# InvalidPathOfParallelConduits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..InvalidPathOfParallelConduits Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Invalid path of parallel conduits
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidPathOfParallelConduits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidPathOfParallelConduits As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidPathOfParallelConduits {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace